clear
clc
close();

A = 1;                // амплітуда
f = 10;               // частота сигналу, Гц
fd = 256;             // частота дискретизації, Гц
T = 1;                // тривалість сигналу,с
T1 = 200 * 0.001;     //200 ms бо 100 не вистачає
dt = 1 / fd;          // крок дискретизації, с

t = 0:dt:T-dt;
x = A * sin(2 * %pi * f * t);

// коефіцієнти різницевої схеми, задані варіантом
b = [0.598,  0.181,  0.018,      0,  0.298, -0.161];
a = [    1,  0.670,  0.378, -0.185, -0.112,  0.050];

// y0 -реакція системи на вхідний сигнал за нульових поч.умов
y0 =filter(b, a, x);

figure(1,'BackgroundColor',[1, 1, 1]);
plot2d(t,x,2),plot2d(t,y0,5)
legend('вхідний сигнал', 'реакція системи за нульових початкових умов', 'position',[T/2-dt,max(max(x,y0))+0.3]);

//визначення коефіцієнта передачі
[m_x, n] = max(x);
[m_y, n1] = max(y0);
K = m_y / m_x;
disp("Коефіцієнт передачі (підсилення) на частоті 10 Гц=", K)
R = t(n1) - t(n);
disp("Різниця фаз становить", R)

l1=max(length(a), length(b)) - 1;
z0 = rand(l1, 1);
y1 =filter(b, a, x,z0); // y1 -реакція системи на вхідний сигнал за випадкових поч.умов

figure(2,'BackgroundColor',[1, 1, 1]);
plot2d(t, x, 2),plot2d(t, y0, 5), plot(t, y1, 'm');
legend('вхідний сигнал', 'реакція системи за нульових початкових умов', 'реакція системи за випадкових почат.умов','position',[T/2-dt,max(max(x,y0,y1))+0.3]);

// перші 100 мс окремо
t1 = 0:dt:T1;
x1 = x(1:length(t1));
y11 = y1(1:length(t1));
y01 = y0(1:length(t1));

figure (3,'BackgroundColor',[1, 1, 1]);
plot(t1, x1,'b+-'), plot(t1, y01,'r+-'),plot(t1, y11, 'm+-')

// визначення повної імпульсної характеристики
u0 = [1, zeros(1, 127)];
h = filter(b, a, u0);
figure(4, 'BackgroundColor', [1, 1, 1]);
subplot(2, 1, 1), plot(0:127, u0, 'blue'), title('Одиничний імпульс');
subplot(2, 1, 2), plot(0:127, h, 'red'), title('Імпульсна характеристика');

// визначення реакції системи на вхідний сигнал x, через згортку з ІХ
u0 = [1, zeros(1, 255)];
h = filter(b, a, u0);
ys1_1 = conv(x, h);
t1 = 0:dt:dt * (length(ys1_1) - 1);
figure(5, 'BackgroundColor', [1, 1, 1]);
plot2d(t, x,2), plot2d(t1, ys1_1, 5);
legend('вхідний сигнал', 'реакція системи за нульових початкових умов', 'position',[T/2-dt,max(max(x,y0))+0.3]);
