// функція для обчислення частотної характеристики системи
function [H, f]=freqz(b, a, Fs)
    // Отримуємо довжину векторів коефіцієнтів чисельника (b) та знаменника (a)
    N = length(b);
    M = length(a);
    
    l = max(N, M);  // визначаємо максимальну довжину між чисельником і знаменником
    
    N_M = N - M;    // різниця між довжинами векторів
    
    // якщо довжина чисельника менша, заповнюємо його нулями до потрібної довжини
    if N_M < 0 then
        b = [b, zeros(1, abs(N_M))];
    else
        a = [a, zeros(1, N_M)];
    end
    
    // обчислюємо частотну характеристику для кожної частоти від 0 до Fs/2
    for f = 0:1:(Fs / 2) - 1
        w_norm = 2 * %pi * (f / Fs);      // нормалізована частота
        
        k = 0:1:l-1;  // створюємо індекси для обчислення експоненти
        
        // обчислюємо знаменник і чисельник передаточної функції у частотній області
        s1 = sum(a .* exp(-k .* %i * w_norm));
        s2 = sum(b .* exp(-k .* %i * w_norm));
        
        H(1, f + 1) = s2 ./ s1;       // отримуємо частотну характеристику H на даній частоті
    end
    
    f = 0:1:Fs/2 - 1;    // створюємо вектор частот для подальшого аналізу
endfunction

clc;
close(winsid());

// коефіцієнти різницевої схеми
b = [0.598,  0.181,  0.018,      0,  0.298, -0.161];
a = [    1,  0.670,  0.378, -0.185, -0.112,  0.050];
Fs = 256;   // частота дискретизації
 
// викликаємо функцію для обчислення частотної характеристики
[H, f] = freqz(b, a, Fs);

// перетворюємо частотну характеристику в децибели та фази
[db, phi] = dbphi(H);
ASH = abs(H);
FSH = atan(imag(H) ./ real(H));

// вивід графіка АЧХ та ФЧХ в шкалі db та у абсолютних значення
figure(1, 'BackgroundColor', [1,1,1]);
subplot(2,2,1), plot(f, db, 'm', 'LineWidth', 2), title(' Характеристика спаду, db');
xgrid(); 
subplot(2,2,3), plot(f, ASH, 'm', 'LineWidth', 2), title('АЧХ');
xgrid(); 
subplot(2,2,2), plot(f, phi, 'm', 'LineWidth', 2), title('ФЧХ');
xgrid(); 
subplot(2,2,4), plot(f, FSH, 'm', 'LineWidth', 2), title('ФЧХ1');
xgrid(); 

// знаходження частотної характеристики як перетворення фурє від ІХ
u0 = [1, zeros(1, 255)];
h = filter(b, a, u0);
H1 = fft(h);

// обчислюємо амплітуду та фазу для отриманої частотної характеристики
[db1, phi1] = dbphi(H1);
ASH1 = abs(H1);
FSH1 = atan(imag(H1) ./ real(H1));

// виведення графіків повної амплітудної та фазової характеристик
figure(2, 'BackgroundColor', [1,1,1]);
subplot(2,2,1), plot(db1, 'r', 'LineWidth', 2), title(' Повна характеристика спаду, db');
xgrid(); 
subplot(2,2,3), plot(ASH1, 'r', 'LineWidth', 2), title('Повна АЧХ');
xgrid(); 
subplot(2,2,2), plot(phi1, 'r', 'LineWidth', 2), title('Повна ФЧХ');
xgrid(); 
subplot(2,2,4), plot(FSH1, 'r', 'LineWidth', 2), title('Повна ФЧХ1');
xgrid(); 

figure(3, 'BackgroundColor', [1,1,1]);
plot(f, ASH, 'b', 'LineWidth', 2), title('АЧХ');
xlabel('частота, Гц');
xgrid(); 
plot(f, ones(1, length(f)), 'r--', 'LineWidth', 2);
plot(10 * ones(1, length(f)), min(ASH):(max(ASH) - min(ASH)) / 127:max(ASH), 'm--', 'LineWidth', 2);

// знаходження значення АЧХ на частоті 10 Гц
index_10 = find(abs(f - 10) == min(abs(f - 10)));    // індекс частоти 10 Гц
printf("Значення на x=10: y=%f\n", ASH(index_10));

disp('АЧХ на 10 Гц становить:', ASH(11));
disp('ФЧХ на 10 Гц становить:', FSH(11));

// створення вектору часу для моделювання сигналів
duration = 1;                // тривалість в секундах
t = 0:1/Fs:duration - 1/Fs;  // вектор часу

// генеруємо квадратурний сигнал з частотою 3 Гц
s6 = squarewave(2 * %pi * 3 * t, 30);   // квадратурний сигнал 3 Гц, заповнення 30%
ys6 = filter(b, a, s6);                 // вихідний сигнал після проходження через систему
figure(4, 'BackgroundColor', [1,1,1]);
plot(t, s6, 'b', t, ys6, 'r');
title('Вхідний та вихідний сигнали при частоті 3 Гц');
xgrid(); 

// генеруємо квадратурний сигнал з частотою 10 Гц
s7 = squarewave(2 * %pi * 10 * t, 50);  // квадратурний сигнал 10 Гц, заповнення 50%
ys7 = filter(b, a, s7);                 // вихідний сигнал після проходження через систему
figure(5, 'BackgroundColor', [1,1,1]);
plot(t, s7, 'b', t, ys7, 'r');
title("Вхідний та вихідний сигнали при частоті 10 Гц");
xgrid(); 

min_ASH = min(ASH);
disp("Мінімальний коефіцієнт передачі становить: "), disp(min_ASH);
