clc;
clear;
close();

m = 10;                 // експонента для кількості точок
N = 2 ^ m;              // загальна кількість точок
T = 6;                  // загальний інтервал дослідження
dt = T / N;             // крок дискретизації
t = -3 : dt : 3 - dt;   // вектор часу від -3 до 3 з кроком dt

// обчислення сигналу x(t)
x = 3 * exp(-abs(t));   // Використовуємо abs(t) для модуля

// обчислення сигналу y(t)
y = zeros(1, N);        // ініціалізація вектора y нулями
y(t >= -2 & t <= 0) = 2 * exp(t(t >= -2 & t <= 0)); // Функція y(t) = 2 * exp(t)

// візуалізація сигналів
figure(1, 'BackgroundColor', [1,1,1]);
h1 = plot(t, x, 'r')
h1.thickness = 3;

h2 = plot(t, y, 'b');
h2.thickness = 3;

xgrid(); 
legend([h1 h2], "Вхідний сигнал - x(t)", "Вхідний сигнал - y(t)");
title('Вхідні сигнали');
xlabel('t');
ylabel('Амплітуда');

// обчислення автокореляційних функцій
Bxx = (1 / N) * xcorr(x, x);
Byy = (1 / N) * xcorr(y, y);

// візуалізація автокореляційних функцій
figure(2, 'BackgroundColor', [1,1,1]);

subplot(2,1,1);
h3 = plot(Bxx, 'r');
h3.thickness = 2;
title('Автокореляційна функція сигналу X');
xgrid();

subplot(2,1,2);
h4 = plot(Byy, 'b');
h4.thickness = 2;
title('Автокореляційна функція сигналу Y');
xgrid(); 

// обчислення взаємокореляційної функції
t_corr = [ -T+dt : dt : T-dt ];       // визначаємо вектор часу для взаємокореляційної функції
Bxy = (1 / ( 2 * N)) * xcorr(x, y);   // взаємокореляційна функція між x(t) та y(t)

// візуалізація взаємокореляційної функції
figure(3, 'BackgroundColor', [1,1,1]);

subplot(2,1,1);
h5 = plot(Bxy, 'r');
h5.thickness = 3;
title('Взаємокореляційна функція сигналів X та Y, відносно номеру відліку');
xgrid();

subplot(2,1,2);
h6 = plot(t_corr, Bxy, 'g');
h6.thickness = 3; 
title('Взаємокореляційна функція сигналів X та Y, відносно часу');
xgrid();

// обчислення згортки сигналів
Cxy = conv(x, y);
y_inv = y($:-1:1);
Cxy1 = conv(x, y_inv);

// візуалізація згортки сигналів
figure(4, 'BackgroundColor', [1,1,1]);

subplot(2,1,1);
h7 = plot(Cxy ./ (2 * N), 'b'); 
h7.thickness = 3; 
title('Згортка сигналів X та Y');
xgrid();

subplot(2,1,2);
h8 = plot(Cxy1 ./ (2 * N), 'g');
h8.thickness = 3; 
title('Згортка сигналів X та Y_{inv}');
xgrid();

// знаходження піку взаємокореляційної функції
[d, d1] = max(Bxy);
disp('Максимальне значення ВКФ становить: ', d);
disp('Максимум досягається у точці з індексом: ', d1);
disp('Це в часі відповідає значенню: ', t_corr(d1));
